In [1]:
import pandas as pd

df = pd.read_excel('lookup.xlsx',sheetname='Table')
df.head()

    MSN Type
0   123    A
1   456    C
2   789    B
3  1234    A
4  4564    D

In [2]:
df_yom = pd.read_excel('lookup.xlsx',sheetname='YOM')
df_yom.head()

     MSN   YOM     Info  Serial_No
0  78998  2001   string      78998
1  45665  2005  string2      45665
2  12332  2010  string3      12332
3   7989  1987      st3       7989
4   4564  1955    sdfl3       4564

# Merge
### Merge All Columns

In [3]:
df1 = pd.merge(df,df_yom,how='left',on='MSN')
df1.head()

    MSN Type   YOM     Info  Serial_No
0   123    A  1994    why??        123
1   456    C  2022   this12        456
2   789    B  2019  this123        789
3  1234    A  2017  adsl098       1234
4  4564    D  1955    sdfl3       4564

### Merge Select Columns

In [4]:
df2 = pd.merge(df,df_yom.loc[:,['MSN','YOM']],how='left',on='MSN')
df2.head()

    MSN Type   YOM
0   123    A  1994
1   456    C  2022
2   789    B  2019
3  1234    A  2017
4  4564    D  1955

### Merge Select Columns where names are different

In [20]:
df3 = (pd.merge(df,df_yom.loc[:,['Serial_No','YOM']],how='left',left_on='MSN',right_on='Serial_No')
       .drop('Serial_No',axis=1)
      )
df3.head()

    MSN Type   YOM
0   123    A  1994
1   456    C  2022
2   789    B  2019
3  1234    A  2017
4  4564    D  1955

In [21]:
df_right = df_yom
right_merge = 'YOM'
left_on = 'MSN'
right_on = 'Serial_No'

# generalized
df4 = (pd.merge(df,df_right.loc[:,[right_on,right_merge]],how='left',left_on=left_on,right_on=right_on)
       .drop(right_on,axis=1)
      )
df4.head()

    MSN Type   YOM
0   123    A  1994
1   456    C  2022
2   789    B  2019
3  1234    A  2017
4  4564    D  1955

# Map

In [22]:
# https://chrisalbon.com/python/pandas_map_values_to_values.html
df5 = pd.map()

AttributeError: 'DataFrame' object has no attribute 'crosstab'